# #DATA CLEANING ASSIGNMENT

In [183]:
import pandas as pd
import numpy as np

In [311]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',

'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)           NaN      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France           NaN    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

1). Some values in the the FlightNumber column are missing. These numbers are
meant to increase by 10 with each row so 10055 and 10075 need to be put in
place. Fill in these missing numbers and make the column an integer column
(instead of a float column).

In [323]:
df['FlightNumber'] = df['FlightNumber'].interpolate().astype(int)

df['FlightNumber']

0    10045
1    10055
2    10065
3    10075
4    10085
Name: FlightNumber, dtype: int32

2). The From_To column would be better as two separate columns! Split each
string on the underscore delimiter _ to give a new temporary DataFrame with
the correct values. Assign the correct column names to this temporary
DataFrame.

In [164]:
n=df.columns[2]
p=n.split('_')
r=df.copy()
for i in p:
    r[i]=df["From_To"].copy()
j=r[["From","To"]]
print("\n\ntemporary data frame is 'j' \n",'-'*100,sep='')
j

temporary data frame is 'j'
----------------------------------------------------------------------------------------------------

               From                To
0      LoNDon_paris      LoNDon_paris
1      MAdrid_miLAN      MAdrid_miLAN
2  londON_StockhOlm  londON_StockhOlm
3    Budapest_PaRis    Budapest_PaRis
4   Brussels_londOn   Brussels_londOn

3). Notice how the capitalisation of the city names is all mixed up in this
temporary DataFrame. Standardise the strings so that only the first letter is
uppercase (e.g. "londON" should become "London".)

In [165]:
new_column=df['From_To'].str.capitalize()
r=df.copy()
r['From_To']=new_column
r

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      London_paris      [23, 47]
1    <Air France> (12)           NaN      Madrid_milan            []
2  (British Airways. )       10065.0  London_stockholm  [24, 43, 87]
3       12. Air France           NaN    Budapest_paris          [13]
4          "Swiss Air"       10085.0   Brussels_london      [67, 32]

4.) Delete the From_To column from df and attach the temporary DataFrame
from the previous questions.

In [312]:
df.drop("From_To",axis=1,inplace=True)

In [313]:
df["From"]=j['From']
df["To"]=j["To"]

In [314]:
df

,Airline,FlightNumber,RecentDelays,From,To
0,KLM(!),10045.0,"[23, 47]",LoNDon_paris,LoNDon_paris
1,<Air France> (12),NaN,[],MAdrid_miLAN,MAdrid_miLAN
2,(British Airways. ),10065.0,"[24, 43, 87]",londON_StockhOlm,londON_StockhOlm
3,12. Air France,NaN,[13],Budapest_PaRis,Budapest_PaRis
4,"""Swiss Air""",10085.0,"[67, 32]",Brussels_londOn,Brussels_londOn

5). In the RecentDelays column, the values have been entered into the
DataFrame as a list. We would like each first value in its own column, each

second value in its own column, and so on. If there isn't an Nth value, the value
should be NaN.
Expand the Series of lists into a DataFrame named delays, rename the columns
delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df
with delays.

In [252]:
df["RecentDelays"].values.tolist()

[[23, 47], [], [24, 43, 87], [13], [67, 32]]

In [253]:
d = pd.DataFrame(df['RecentDelays'].values.tolist(), columns=['delay_1','delay_2','delay_3'])

In [254]:
df

               Airline  FlightNumber           From_To  RecentDelays
0               KLM(!)       10045.0      LoNDon_paris      [23, 47]
1    <Air France> (12)           NaN      MAdrid_miLAN            []
2  (British Airways. )       10065.0  londON_StockhOlm  [24, 43, 87]
3       12. Air France           NaN    Budapest_PaRis          [13]
4          "Swiss Air"       10085.0   Brussels_londOn      [67, 32]

In [256]:
par=pd.concat((df,d),axis=1)

par.drop('RecentDelays',axis=1,inplace=True)

par

,Airline,FlightNumber,From_To,delay_1,delay_2,delay_3
0,KLM(!),10045.0,LoNDon_paris,23.0,47.0,NaN
1,<Air France> (12),NaN,MAdrid_miLAN,NaN,NaN,NaN
2,(British Airways. ),10065.0,londON_StockhOlm,24.0,43.0,87.0
3,12. Air France,NaN,Budapest_PaRis,13.0,NaN,NaN
4,"""Swiss Air""",10085.0,Brussels_londOn,67.0,32.0,NaN